note = "【Excel】联动插件"

class 任意类型(str):
    def __ne__(self, __value: object) -> bool:
        return False
any_typ = 任意类型("*")

from .运算型节点 import *
from .字符串节点 import *
from .文件处理节点 import *
from .功能节点 import *

节点类映射 = {
    #运算型节点：运算型节点
    "比较数值": 比较数值,
    "规范数值": 浮点数转整数,
    "生成范围数组": 生成数字,
    "范围内随机数": 获取范围内随机整数,

    #字符串处理：字符串节点
    "文本输入": 文本输入,  
    "文本到列表": 文本到列表,  
    "文本拼接": 文本拼接器,  
    "多参数输入": 多参数输入节点,
    "整数参数": 数字提取器, 
    "添加前后缀": 添加前后缀,
    "提取标签之间": 提取子字符串,
    "按数字范围提取": 按索引提取子字符串,
    "分隔符拆分两边": 按分隔符拆分字符串,
    "常规处理字符": 处理字符串,
    "提取前后字符": 提取前后字符,
    "简易文本替换": 简易文本替换,  
    "替换第n次出现": 替换第n次出现,
    "多次出现依次替换": 多次替换,
    "批量替换字符": 批量替换字符串,
    "随机行内容": 从文本随机行,
    "判断是否包含字符": 判断是否包含字符,
    "段落每行添加前后缀": 每行添加前后缀,
    "段落提取指定索引行": 段落提取指定索引行,
    "段落提取或移除字符行": 段落提取或移除字符行,
    "段落字数条件过滤行": 按字数过滤行,
    "按序号提取分割文本": 分割并提取文本,
    "文本出现次数": 文本出现次数,
    "文本拆分": 文本拆分,
    "提取特定行": 提取特定行,
    "删除标签内的内容": 删除字符间内容,
    "随机打乱": 打乱文本行,
    "判断文本包含内容": 判断文本包含内容,
    "文本按条件判断": 文本条件检查,
    "文本组合": 文本组合,
    "提取多层指定数据": 提取特定数据,
    "指定字符行参数": 查找首行内容,
    "获取整数": 获取整数参数,
    "获取浮点数": 获取浮点数参数,
    "视频指令词模板": 生成视频提示,

    #文件处理：文件处理节点
    "全能加载图像": 全能加载图像,
    "加载重置图像": 加载重置图像,
    "重置图像": 重置图像,
    "裁剪图像": 裁剪图像,
    "保存图像": 保存图像, 
    "文件操作": 文件操作,   
    "替换文件名": 替换文件名,    
    "文本写入TXT": 写入文本文件,   
    "清理文件": 清理文件,   
    "文件路径和后缀统计": 文件路径和后缀统计,
    "文字图像": 文字图像,
    "图像层叠加": 图像层叠加,

    "读取表格数据": 读取Excel数据,
    "写入表格数据": 写入Excel数据,
    "图片插入表格": 写入Excel图片,
    "查找表格数据": 查找Excel数据,
    "读取表格数量差": 读取Excel行列差,

    #功能型节点：功能节点
    "当前时间(戳)": 获取当前时间,
    "随机整数": 简单随机种子,
    "选择参数": 选择参数,
    "读取页面": 读取网页节点,
    "VAE解码预览": 解码预览,
    "完成提醒": 完成提醒,     
}

节点显示名称映射 = {
   #运算型节点：运算型节点
   "比较数值": "比较数值",
   "规范数值": "浮点数转整数",
   "生成范围数组": "生成数字",
   "范围内随机数": "获取范围内随机整数",

   #字符串处理：字符串节点
   "文本输入": "文本输入",
   "文本到列表": "文本到列表",
   "文本拼接": "文本拼接器",  
   "多参数输入": "多参数输入节点",
   "整数参数": "数字提取器",
   "添加前后缀": "添加前后缀",
   "提取标签之间": "提取子字符串",
   "按数字范围提取": "按索引提取子字符串",
   "分隔符拆分两边": "按分隔符拆分字符串",
   "常规处理字符": "处理字符串",
   "提取前后字符": "提取前后字符",
   "简易文本替换": "简易文本替换",
   "替换第n次出现": "替换第n次出现",
   "多次出现依次替换": "多次替换",
   "批量替换字符": "批量替换字符串",
   "随机行内容": "从文本随机行",
   "判断是否包含字符": "判断是否包含字符",
   "段落每行添加前后缀": "每行添加前后缀",
   "段落提取指定索引行": "段落提取指定索引行",
   "段落提取或移除字符行": "段落提取或移除字符行",
   "段落字数条件过滤行": "按字数过滤行",
   "按序号提取分割文本": "分割并提取文本",
   "文本出现次数": "文本出现次数",
   "文本拆分": "文本拆分",
   "提取特定行": "提取特定行",
   "删除标签内的内容": "删除字符间内容",
   "随机打乱": "打乱文本行",
   "判断文本包含内容": "判断文本包含内容",
   "文本按条件判断": "文本条件检查",
   "文本组合": "文本组合",
   "提取多层指定数据": "提取特定数据",
   "指定字符行参数": "查找首行内容",
   "获取整数": "获取整数参数",
   "获取浮点数": "获取浮点数参数",
   "视频指令词模板": "生成视频提示",

   #文件处理：文件处理节点
   "加载重置图像": "加载重置图像",
   "全能加载图像": "全能加载图像",
   "重置图像": "重置图像",
   "裁剪图像": "裁剪图像",
   "保存图像": "保存图像",
   "文件操作": "文件操作",
   "替换文件名": "替换文件名",
   "文本写入TXT": "文本写入TXT",
   "清理文件": "清理文件",
   "图像层叠加": "图像层叠加",
   "文字图像": "文字图像",

   "读取表格数据": "读取表格数据",
   "写入表格数据": "写入表格数据",
   "图片插入表格": "写入Excel图片",
   "查找表格数据": "查找表格数据",
   "读取表格数量差": "读取表格数量差",
   
    #功能型节点：功能节点
   "当前时间(戳)": "当前时间(戳)",
   "随机整数": "随机整数", 
   "选择参数": "选择参数",
   "读取页面": "读取页面",
   "VAE解码预览": "解码预览",
   "完成提醒": "完成提醒",
}

# 保持原有的导出变量名以兼容原有代码
NODE_CLASS_MAPPINGS = 节点类映射
NODE_DISPLAY_NAME_MAPPINGS = 节点显示名称映射