note = "【Excel】联动插件"

class 任意类型(str):
    def __ne__(self, __value: object) -> bool:
        return False
any_typ = 任意类型("*")

# 导入各模块
from .运算型节点 import *
from .字符串节点 import *
from .文件处理节点 import *
from .功能节点 import *

# 节点类映射：[ComfyUI左侧搜索名称]: [后端类名]
节点类映射 = {
    # 运算型节点
    "比较数值": 比较数值,
    "规范数值": 浮点数转整数,
    "生成范围数组": 生成数字,
    "范围内随机数": 获取范围内随机整数,

    # 字符串处理
    "按数字范围提取": 按索引提取子字符串,
    "分隔符拆分两边": 按分隔符拆分字符串,
    "常规处理字符": 处理字符串,
    "提取前后字符": 提取前后字符,
    "简易文本替换": 简易文本替换,
    "替换第n次出现": 替换第n次出现,
    "判断是否包含字符": 判断是否包含字符,
    "段落提取指定索引行": 段落提取指定索引行,
    "段落提取或移除字符行": 段落提取或移除字符行,
    "段落字数条件过滤行": 按字数过滤行,
    "按序号提取分割文本": 分割并提取文本,
    "文本出现次数": 文本出现次数,
    "删除标签内的内容": 删除字符间内容,
    "判断文本包含内容": 判断文本包含内容,
    "文本按条件判断": 文本条件检查,
    "提取多层指定数据": 提取特定数据,
    "指定字符行参数": 查找首行内容,
    "获取整数": 获取整数参数,
    "获取浮点数": 获取浮点数参数,

    # 文件处理
    "替换文件名": 替换文件名,
    "文件路径和后缀统计": 文件路径和后缀统计,
    "图像层叠加": 图像层叠加,
    "读取表格数据": 读取Excel数据,
    "写入表格数据": 写入Excel数据,
    "图片插入表格": 写入Excel图片,
    "查找表格数据": 查找Excel数据,
    "读取表格数量差": 读取Excel行列差,
    "写入Excel时间": 写入Excel时间,

    # 功能型节点
    "当前时间(戳)": 获取当前时间,
    "随机整数": 简单随机种子,
    "选择参数": 选择参数,
    "读取页面": 读取网页节点,
    "完成提醒": 完成提醒,
}

# 节点显示名称映射：[ComfyUI左侧搜索名称]: [面板显示中文名称]
节点显示名称映射 = {
    # 运算型节点
    "比较数值": "比较数值",
    "规范数值": "规范数值",
    "生成范围数组": "生成范围数组",
    "范围内随机数": "范围内随机数",

    # 字符串处理
    "按数字范围提取": "按索引提取子字符串",
    "分隔符拆分两边": "按分隔符拆分字符串",
    "常规处理字符": "常规处理字符",
    "提取前后字符": "提取前后字符",
    "简易文本替换": "简易文本替换",
    "替换第n次出现": "替换第n次出现",
    "判断是否包含字符": "判断是否包含字符",
    "段落提取指定索引行": "段落提取指定索引行",
    "段落提取或移除字符行": "段落提取或移除字符行",
    "段落字数条件过滤行": "段落字数条件过滤行",
    "按序号提取分割文本": "按序号提取分割文本",
    "文本出现次数": "文本出现次数",
    "删除标签内的内容": "删除标签内的内容",
    "判断文本包含内容": "判断文本包含内容",
    "文本按条件判断": "文本按条件判断",
    "提取多层指定数据": "提取多层指定数据",
    "指定字符行参数": "指定字符行参数",
    "获取整数": "获取整数参数",
    "获取浮点数": "获取浮点数参数",

    # 文件处理
    "替换文件名": "替换文件名",
    "文件路径和后缀统计": "文件路径和后缀统计",
    "图像层叠加": "图像层叠加",
    "读取表格数据": "读取表格数据",
    "写入表格数据": "写入表格数据",
    "图片插入表格": "图片插入表格",
    "查找表格数据": "查找表格数据",
    "读取表格数量差": "读取表格数量差",
    "写入Excel时间": "写入Excel时间",

    # 功能型节点
    "当前时间(戳)": "当前时间(戳)",
    "随机整数": "随机整数",
    "选择参数": "选择参数",
    "读取页面": "读取页面",
    "完成提醒": "完成提醒",
}

# 导出变量名以供 ComfyUI 加载
NODE_CLASS_MAPPINGS = 节点类映射
NODE_DISPLAY_NAME_MAPPINGS = 节点显示名称映射

__all__ = ['NODE_CLASS_MAPPINGS', 'NODE_DISPLAY_NAME_MAPPINGS']